app/Controllers/GameController.php

    public function create()
    {
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function store()
    {
        $gameModel = new GameModel();

        $data = [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'category_id' => $this->request->getPost('category_id')
        ];

        $file = $this->request->getFile('image');
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $file->move(ROOTPATH . 'public/uploads/images/', $newName);
            $data['image'] = $newName;
        }

        $gameModel->insert($data);
---
INSERT INTO `games` (`title`, `description`, `category_id`, `image`) VALUES ('smt v vengeance', 'smt series', '3', '1718846302_7df6b340c0cff98e47a3.jpg')

    public function delete($id)
    {
        $gameModel = new GameModel();

        $game = $gameModel->find($id);

        $gameModel->delete($id);
---
SELECT *
FROM `games`
WHERE `games`.`id` = '24'
DELETE FROM `games`
WHERE `id` IN ('24')