app/Models/GameModel.php

SELECT COUNT(*) AS `numrows`
FROM `games`
JOIN `categories` ON `categories`.`id` = `games`.`category_id`
SELECT `games`.*, `categories`.`name` as `category`
FROM `games`
JOIN `categories` ON `categories`.`id` = `games`.`category_id`
ORDER BY `games`.`id` DESC
 LIMIT 10
---
    public function getPaginatedGamesWithCategory($perPage, $currentPage)
    {
        return $this->select('games.*, categories.name as category')
                    ->join('categories', 'categories.id = games.category_id')
                    ->orderBy('games.id', 'DESC')
                    ->paginate($perPage, 'default', $currentPage);